app/controllers/checkouts_controller.rb

  def show
    current_user = User.create :email => "janedoe@ga.co"
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "janedoe@ga.co"], ["created_at", "2021-06-10 02:48:50.168204"], ["updated_at", "2021-06-10 02:48:50.168204"]]